In [ ]:
print("this is just for testing purposes only this is the very interesting practise amazing  ")

this is just for testing purposes only this is the very interesting practise

In [1]:
import pandas as pd
import numpy as np  
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['John Doe', 'Jonh Doe', 'Jane Doe', 'Jane Doe'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}
# make pandas dataframe
df = pd.DataFrame(data)
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1  01-12-2022         U.S.A.  Jonh Doe       200.0       150.0
2  2022/12/01        America  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

In [ ]:
# standardize date format
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df.head()
df['date'] = df['date'].dt.strftime('%Y-%m-%d')
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1         NaN         U.S.A.  Jonh Doe       200.0       150.0
2         NaN        America  Jane Doe         NaN       300.0
3         NaN  United States  Jane Doe       200.0       150.0

In [23]:
import pandas as pd

# Recreate your DataFrame with the original date strings
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Juunaid', 'Junaid', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}

df = pd.DataFrame(data)

# Now apply your date parsing method
formats = ['%Y-%m-%d', '%d-%m-%Y', '%Y/%m/%d', '%m-%d-%Y']

for fmt in formats:
    try:
        df['date'] = pd.to_datetime(df['date'], format=fmt, errors='coerce')
        if not df['date'].isna().all():
            break
    except:
        continue

print(df.head())

        date        country     name  sales_2020  sales_2021
0 2021-12-01            USA  Juunaid       100.0         NaN
1        NaT         U.S.A.   Junaid       200.0       150.0
2        NaT        America    Hamza         NaN       300.0
3        NaT  United States    Hazma       200.0       150.0

In [28]:
#harmonize country names
country_mapping = {'USA': 'United States', 'U.S.A.': 'United States', 'America': 'United States', 'United States': 'United States'}
df['country'] = df['country'].map(country_mapping)
df.head()

        date        country     name  sales_2020  sales_2021
0 2021-12-01  United States  Juunaid       100.0         NaN
1        NaT  United States   Junaid       200.0       150.0
2        NaT  United States    Hamza         NaN       300.0
3        NaT  United States    Hazma       200.0       150.0

In [30]:
#correct the typos in names
df['name'] = df['name'].replace({'Juunaid': 'Junaid', 'Hazma': 'Hamza'})
df.head()

        date        country    name  sales_2020  sales_2021
0 2021-12-01  United States  Junaid       100.0         NaN
1        NaT  United States  Junaid       200.0       150.0
2        NaT  United States   Hamza         NaN       300.0
3        NaT  United States   Hamza       200.0       150.0

In [31]:
#Remove duplicates
df = df.drop_duplicates(subset="name")
df.head()

        date        country    name  sales_2020  sales_2021
0 2021-12-01  United States  Junaid       100.0         NaN
2        NaT  United States   Hamza         NaN       300.0